# Создаем начальный список заказов на фрилансе
orders = ["Скрипт для Excel", "Бот для автомойки", "Парсер Авито"]
print("Начальный список заказов:", orders)

# .append() добавляет новый элемент в самый конец списка
orders.append("Бот-хранилище")

# .pop(0) удаляет ПЕРВЫЙ элемент (индекс 0) и возвращает его.
# Мы сохраняем этот удаленный элемент в переменную 'done_orders'
done_orders = orders.pop(0)

# Выводим имя выполненного заказа динамически
print("Заказ '" + done_orders + "' успешно выполнен!")

# .remove() находит элемент по его текстовому значению и удаляет его
orders.remove("Бот для автомойки")

# len(orders) считает количество оставшихся элементов в списке.
# Выводим финальный список и его актуальную длину
print("Оставшиеся заказы:", orders, "| Количество задач:", len(orders))
