# Наш неизменяемый кортеж с разрешенными расширениями (добавили jpeg для теста)
allowed_extensions = ("jpg", "png", "txt", "jpeg")

# Запрашиваем имя файла
file = input("Введите название файла полностью: ")

# Метод .split(".") разбивает строку на список частей по точкам.
# Индекс [-1] всегда берет самый последний элемент из этого списка (само расширение).
extension = file.split(".")[-1]

# Переводим расширение в нижний регистр на случай, если юзер ввел .PNG или .JPG
extension = extension.lower()

# Проверяем, есть ли расширение в нашем разрешенном списке
if extension in allowed_extensions:
    print("Файл успешно загружен!")
else:
    print("Ошибка: расширение", extension, "не поддерживается сервером!")
