# Наша база данных пользователей (логин: пароль)
users = {"rustam": "pass123", "admin": "root55", "guest": "12345"}

# Запрашиваем логин у пользователя
login = input("Введите логин: ")

# Проверяем, есть ли такой ключ (логин) в нашем словаре
if login not in users:
    print("Пользователь не найден! Хотите зарегистрироваться?")
else:
    # Если логин совпал, запрашиваем пароль
    password = input("Введите пароль: ")

    # Строго сравниваем введенный пароль с паролем из базы (users[login])
    if password != users[login]:
        print("Неверный пароль, пожалуйста убедитесь что ввели пароль правильно.")
    else:
        print("Доступ разрешен! Добро пожаловать в ваше ТГ-хранилище!")
