# Запрашиваем у пользователя количество гигабайт и переводим в целое число
user = int(input("Сколько гигабайт желаете купить? "))

# Обычная функция (def) для расчета стоимости дискового пространства
def calculate_price(gb):
    # Если пользователь берет оптом больше 100 ГБ, даем скидку (0.3$ за ГБ)
    if gb > 100:
        return gb * 0.3
    # Иначе считаем по стандартному тарифу (0.5$ за ГБ)
    else:
        return gb * 0.5

# Однострочная лямбда-функция для быстрого перевода Гигабайт в Мегабайты
to_mb = lambda gb: gb * 1024

# Вызываем функции и передаем им введенное пользователем число
final_price = calculate_price(user)
megabytes = to_mb(user)

# Выводим итоговые расчеты в консоль через запятые
print("Итоговая стоимость покупки составит:", final_price, "$")
print("Объем памяти в Мегабайтах составит:", megabytes, "МБ")
